erp3l/src/Documents/ЛишениеАккредитации/ЛишениеАккредитации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛишениеАккредитации</name>
  <basedOn>Document.АккредитацияПоставщика</basedOn>
  <basedOn>Catalog.АнкетыПоставщиков</basedOn>
  <registerRecords>InformationRegister.СостоянияАккредитованныхПоставщиков</registerRecords>
  <registerRecords>InformationRegister.АккредитованыеПоставщики</registerRecords>
  <attributes>
    <name>АнкетаПоставщика</name>
    <type>
      <types>CatalogRef.АнкетыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПретензии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМоратория</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПоДокументу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументАккредитации</name>
    <type>
      <types>DocumentRef.АккредитацияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>МораторийНаРаботуСПоставщиком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомиссияПоАккредитации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/АккредитацияПоставщика/АккредитацияПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АккредитацияПоставщика</name>
  <basedOn>Catalog.АнкетыПоставщиков</basedOn>
  <basedOn>Document.АккредитацияПоставщика</basedOn>
  <registerRecords>InformationRegister.НоменклатураАккредитованыхПоставщиков</registerRecords>
  <registerRecords>InformationRegister.СостоянияАккредитованныхПоставщиков</registerRecords>
  <registerRecords>InformationRegister.АккредитованыеПоставщики</registerRecords>
  <attributes>
    <name>АнкетаПоставщика</name>
    <type>
      <types>CatalogRef.АнкетыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаАккредитации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСрокаАккредитации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПоДокументу</name>
    <type>
      <types>EnumRef.ВидыРешенийПоДокументуАккредитации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПовторнаяАккредитация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяАккредитация</name>
    <type>
      <types>DocumentRef.АккредитацияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаСогласование</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереаккредитации</name>
    <type>
      <types>EnumRef.ПричинаПереаккредитации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбщиеТребования</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМножества</name>
      <type>
        <types>DefinedType.ТипЗначенияКритерияОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийУчастника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РешениеПоложительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийКомиссии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПоставщика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.ТипНоменклатураЕХ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомиссияПоАккредитации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварныеКатегории</name>
    <attributes>
      <name>ТоварнаяКатегория</name>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ЛишениеАккредитации/Forms/ФормаДокумента/Module.bsl
#Область ОбработкаОсновныхСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	#Область УниверсальныеПроцессыСогласование
		ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма);
	#КонецОбласти
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ЭтоВнешнийПользователь = ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя();
	
	Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(
		АккредитацияПоставщиковУХ.ОрганизацииТребующиеАккредитациюПоставщиков(Объект.Дата));
		
	АккредитацияПоставщиковУХ.УстановитьПредставлениеСтатусаАккредитацииНаФорме(
		ЭтаФорма, Объект.Организация, Объект.АнкетаПоставщика, Объект.Дата);
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	#Область УниверсальныеПроцессыСогласование
		Если ИмяСобытия = "ОбъектСогласован" ИЛИ ИмяСобытия = "ОбъектОтклонен" ИЛИ ИмяСобытия = "МаршрутИнициализирован" ИЛИ ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
			ОпределитьСостояниеОбъекта();
			УстановитьОформлениеФормы();
		КонецЕсли;
	#КонецОбласти
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОформлениеФормы();
КонецПроцедуры


#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы


&НаКлиенте
Процедура ОповеститьПоставщикаОРешении(Команда)
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо записать документ перед отправкой оповещения.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	АккредитацияПоставщиковВызовСервераУХ.ОповеститьПоставщикаОРешенииПоОбъекту(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбработатьИзменениеКлючевыхРеквизитовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ОбработатьИзменениеКлючевыхРеквизитовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МораторийНаРаботуСПоставщикомПриИзменении(Элемент)
	Если Объект.МораторийНаРаботуСПоставщиком Тогда
		Объект.РешениеПоДокументу = Истина;
	КонецЕсли;
	УстановитьОформлениеФормы();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыНаКлиенте


#КонецОбласти

#Область СлужебныеПроцедурыНаСервере


&НаСервере
Процедура УстановитьОформлениеФормы()
	флУтвержденаИлиОтменена = (РеквизитСтатусОбъекта(ЭтаФорма) = Перечисления.СостоянияСогласования.Утверждена) ИЛИ
		(РеквизитСтатусОбъекта(ЭтаФорма) = Перечисления.СостоянияСогласования.Отклонена);
		
	Элементы.ФормаОповеститьПоставщикаОРешении.Видимость = флУтвержденаИлиОтменена И Объект.Проведен;
	
	Элементы.ДатаМоратория.Видимость = Объект.МораторийНаРаботуСПоставщиком;
	Элементы.РешениеПоДокументу.ТолькоПросмотр = Объект.МораторийНаРаботуСПоставщиком;
	Элементы.Ответственный.Видимость = НЕ ЭтоВнешнийПользователь;
	#Если ВебКлиент Тогда
	ОпределитьСостояниеОбъекта(Истина);	
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАккредитацию()
	Если ЗначениеЗаполнено(Объект.АнкетаПоставщика) И ЗначениеЗаполнено(Объект.Организация) Тогда
		ДокументАккредитации = АккредитацияПоставщиковУХ.ПредыдущаяАккредитация(
				Объект.Организация,
				Объект.АнкетаПоставщика,
				Объект.Дата);
	Иначе
		ДокументАккредитации = Документы.АккредитацияПоставщика.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеКлючевыхРеквизитовНаСервере()
	ЗаполнитьАккредитацию();
	АккредитацияПоставщиковУХ.УстановитьПредставлениеСтатусаАккредитацииНаФорме(
		ЭтаФорма, Объект.Организация, Объект.АнкетаПоставщика, Объект.Дата);
	УстановитьОформлениеФормы();
КонецПроцедуры


#КонецОбласти


#Область УниверсальныеПроцессыСогласование

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	Если (Объект.Ссылка.Пустая()) ИЛИ (ЭтаФорма.Модифицированность) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Изменение состояния возможно только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение); 

КонецПроцедуры

&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма, ОбновитьОтветственныхВход);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Изменение состояния возможно только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОрганизации_Подключаемый(Элемент) Экспорт
	ОпределитьСостояниеОбъекта(Истина);		
	ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент);
КонецПроцедуры		// ПриИзмененииЭлементаОрганизации_Подключаемый()

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)
	#Если НЕ ВебКлиент Тогда
	ИмяЭлемента = Элемент.Имя;
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтаФорма["ОбработчикиИзмененияОрганизации"] Цикл
			Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
				СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
				Выполнить СтрокаВыполнения;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли; 
		КонецЦикла;	
	Иначе
		// Передан пустой элемент.
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры		// ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()	

#КонецОбласти
